[
  {
  "id": "proj1",
  "title": "Genius Academy Official Website",
  "image": "https://placehold.co/600x400.png",
  "imageAiHint": "educational website design",
  "domain": "Web Developent",
  "duration": "2 Weeks",
  "client": "Genius Academy, Kalyan-Badlapur",
  "service": "Web Design",
  "description": "A modern, mobile-friendly website for Genius Academy focused on enhancing accessibility and user engagement.",
  "longDescription": "The Genius Academy Official Website was developed with a mobile-first approach, ensuring an optimal experience across all devices. It features user-friendly navigation tailored for students and educators, a clean modern UI/UX with engaging visuals, and a lightweight chatbot built using Botpress for instant query resolution. This project showcased the integration of front-end and back-end skills to deliver a high-performing and professional educational platform aligned with the academy’s goals.",
  "techStack": ["HTML", "CSS", "JavaScript", "Bootstrap", "Botpress"],
  "liveLink": "https://www.geniusacademyonline.com",
  "repoLink": "#"
},
  {
  "id": "proj2",
  "title": "DeDuper: File Deduplication using SHA-256 and AWS Lambda",
  "image": "https://placehold.co/600x400.png",
  "imageAiHint": "cloud storage optimization, AWS Lambda, data deduplication",
  "domain": "Cloud Computing",
  "duration": "1 Month",
  "client": "Cloud Computing Course Work",
  "service": "AWS Project",
  "description": "An intelligent file deduplication system leveraging AWS Lambda, S3, and SHA-256 for optimized cloud storage.",
  "longDescription": "DeDuper is a cloud-based file deduplication solution that enhances storage efficiency using a serverless architecture. It employs client-side SHA-256 hashing to detect duplicates before upload, AWS Lambda for scalable processing, and DynamoDB for metadata storage. Files with identical content are stored only once, and users interact with a seamless interface without noticing backend optimizations. AWS KMS ensures robust encryption, while FastAPI handles user authentication and routing. The system significantly reduces bandwidth, enhances security, and delivers an optimized file management experience.",
  "techStack": ["AWS Lambda", "Amazon S3", "DynamoDB", "FastAPI", "SHA-256", "AWS KMS", "JavaScript"],
  "liveLink": "https://tejass-organization-5.gitbook.io/deduper",
  "repoLink": "https://github.com/tejasgadge2504/DeDuper"
}
,
  {
  "id": "proj3",
  "title": "DigiPal: Your Friend in the Digital World",
  "image": "https://placehold.co/600x400.png",
  "imageAiHint": "mobile app for digital literacy, multilingual support, inclusive tech",
  "domain": "Digital Literacy",
  "duration": "24 Hours",
  "client": "VES Hack It Hackathon",
  "service": "Digital Literacy App",
  "description": "An inclusive mobile app designed to teach digital skills using AI assistance, multilingual voice guidance, and real-world simulations.",
  "longDescription": "DigiPal is an interactive mobile application developed in 24 hours for the VES Hack It Hackathon. It empowers users—especially first-time smartphone users—to confidently navigate digital technologies. The app features voice-guided tutorials in regional languages, AI-powered real-time assistance, and practice modules for smartphone usage, digital communication, and UPI-based transactions. Its learner-centric design ensures accessibility, comprehension, and real-world readiness for individuals across diverse backgrounds.",
  "techStack": ["Flutter", "Firebase", "Dialogflow", "Text-to-Speech APIs", "Python (AI Backend)"],
  "liveLink": "https://digipal.framer.website/",
  "repoLink": "https://github.com/tejasgadge2504/digipal"
},
{
  "id": "proj4",
  "title": "Kawach: Your Digital Shield",
  "image": "https://placehold.co/600x400.png",
  "imageAiHint": "women safety mobile app, emergency alert, AI-powered features",
  "domain": "Women Safety & AI",
  "duration": "24 Hours",
  "client": "TYNET 2.0 Women's Hackathon",
  "service": "Women Safety Mobile App",
  "description": "An AI-powered safety app designed to empower women through real-time alerts, location tracking, and voice-activated SOS features.",
  "longDescription": "Kawach is a safety-focused mobile application. Built to empower women, it includes real-time location tracking, voice-enabled SOS, fake call generation, and AI-driven risk alerts. Kawach integrates Gemini and Dialogflow for conversational support and handles regional language diversity through accessible design. With intuitive UX and powerful emergency tools, Kawach offers a dependable and innovative solution for women's safety in any environment.",
  "techStack": ["Flutter", "Firebase", "Dialogflow", "Gemini API", "Google Maps API", "Text-to-Speech", "Speech Recognition"],
  "liveLink": "https://appetize.io/app/b_legcla5ate3zpk7vjmdbbn4x7a?device=pixel7&osVersion=13.0&toolbar=true",
  "repoLink": "https://github.com/tejasgadge2504/Kawachapp/tree/main"
},
{
  "id": "proj5",
  "title": "FinSight: Finance without Barriers",
  "image": "https://placehold.co/600x400.png",
  "imageAiHint": "voice assistant for finance, visually impaired user using phone, inclusive technology",
  "domain": "AI & Financial Accessibility",
  "duration": "24 Hours",
  "client": "HackAurora, Technovanza VJTI",
  "service": "Voice Enabled Financial Advisor",
  "description": "An award-winning AI-powered voice platform that enables visually impaired users to manage their finances with voice commands and personalized insights.",
  "longDescription": "FinSight is a voice-based financial platform built during HackAurora at Technovanza VJTI. It empowers visually impaired users by providing real-time access to financial data, UPI transactions, and personalized financial guidance via voice. Leveraging Gemini and local biometric security, FinSight simplifies banking tasks such as balance checks, bill payments, and budgeting advice. The app’s accessible design features swipe navigation, TTS/STT modules, and a seamless, secure user experience—making financial inclusion a reality for all.",
  "techStack": ["Flutter", "Firebase", "Gemini API", "TTS/STT APIs", "UPI APIs", "Biometric Auth"],
  "liveLink": "https://fin-sight.netlify.app",
  "repoLink": "https://github.com/tejasgadge2504/FinSightAPP"
},
{
  "id": "proj6",
  "title": "FinEase: AI-powered Financial Assistant for Small Businesses",
  "image": "https://placehold.co/600x400.png",
  "imageAiHint": "AI-powered financial assistant dashboard, cash flow analytics, invoice reminder interface, small business finances",
  "domain": "Fintech / AI Automation",
  "duration": "24 Hours (Hackathon)",
  "client": "SYRUS Hackathon 2025 – UPTIQ Track",
  "service": "AI-based Finance Management",
  "description": "An autonomous financial assistant for small businesses that automates invoice tracking, sends payment reminders, and provides predictive financial analytics through seamless integrations.",
  "longDescription": "FinEase is an AI-powered assistant built to streamline financial workflows for small businesses and startups. Developed during the SYRUS Hackathon 2025, FinEase uses Uptiq AI Workbench to automate tasks such as invoice tracking, overdue payment alerts, smart reminders, and predictive cash flow analysis. It integrates easily with tools like QuickBooks, Xero, Zoho Books, and digital ledger platforms to ensure that business owners can manage their finances without switching software. Built in 24 hours, FinEase was recognized as First Runner-Up in the UPTIQ Track and received wide appreciation for its real-world relevance and user-first approach.",
  "techStack": ["Uptiq AI Workbench", "Python", "Flask", "QuickBooks API", "Zoho Books", "Xero", "AI Agents", "Webhook Automation"],
  "liveLink": "https://youtu.be/uTIHtUJe8ek?si=X_ImFjW5VaD9vePh",
  "repoLink": "https://docs.google.com/document/d/1RhQwJh2QUuCay4XJHj5Ikxv_0KUC-otH1cIRfd6ZkrA/edit?usp=sharing"
},
{
  "id": "proj7",
  "title": "Heartistry: Creating a Kinder World One Entry at a Time",
  "image": "https://placehold.co/600x400.png",
  "imageAiHint": "AI empathy journal, mental health education, students writing journal with compassion",
  "domain": "Mental Health & Education",
  "duration": "2 Weeks",
  "client": "VESIT, CMPN Department",
  "service": "Mental Health App",
  "description": "An AI-powered empathy journal using LLaMA-3 to address bullying, enhance emotional intelligence, and promote kindness through reflective learning.",
  "longDescription": "Heartistry is a mental health and empathy-focused journaling app developed under the Universal Human Values (UHV) initiative. Powered by LLaMA-3, it uses over 500 fine-tuned prompts for scenario-based learning, helping students develop emotional intelligence, empathy, and compassion. By simulating real-life situations and encouraging deep self-reflection, Heartistry provides a personalized and ethical AI-driven learning environment that supports SDGs like Quality Education, Good Health, and Reduced Inequalities.",
  "techStack": ["Flutter", "LLaMA-3", "Firebase", "Python (FastAPI)", "Hugging Face Transformers"],
  "liveLink": "#",
  "repoLink": "https://github.com/UHV-GenAI-Llama/Group-3-B-Heartistry"
},
{
  "id": "proj8",
  "title": "RightsQuest: Gamified Human Rights Education",
  "image": "https://placehold.co/600x400.png",
  "imageAiHint": "children using mobile app, gamified education, human rights learning",
  "domain": "Education & Human Rights",
  "duration": "1 Month (July 2024)",
  "client": "Generative AI Internship - VESIT CMPN Dept",
  "service": "AI-based Educational App",
  "description": "An interactive and gamified learning platform powered by LLaMA-3 that educates children about human rights through AI-generated stories and scenario-based quizzes.",
  "longDescription": "RightsQuest is a mobile application designed to educate children about human rights using AI-generated stories, scenarios, and gamified quizzes. Developed under the Generative AI Open Source Technology Internship at VESIT, the app utilizes the LLaMA-3 model to generate ethical dilemmas and real-world situations that challenge users to choose the most empathetic responses. The app encourages critical thinking, emotional intelligence, and awareness of social justice while maintaining engagement through badges, levels, and interactive storytelling. RightsQuest was awarded 2nd place in the internship’s final showcase.",
  "techStack": ["Flutter", "LLaMA-3", "Firebase", "Dart", "Hugging Face Transformers"],
  "liveLink": "#",
  "repoLink": "https://github.com/UHV-GenAI-Llama/Group-1-B-RightsQuest"
},
{
  "id": "proj9",
  "title": "Recroot: Smart Applicant Tracking System (ATS)",
  "image": "https://placehold.co/600x400.png",
  "imageAiHint": "modern HR dashboard, resume screening system, ATS UI with job applications",
  "domain": "Human Resources / AI + Automation",
  "duration": "2 Weeks (Hackathon Project)",
  "client": "Self Learning",
  "service": "AI-based Recruitment Platform",
  "description": "An advanced ATS platform that automates recruitment workflows—resume screening, job tracking, interviews, and offer letters—using Flask, Firebase, and Cloudinary.",
  "longDescription": "Recroot is a smart Applicant Tracking System designed to revolutionize the hiring process through automation and AI. With resume scoring powered by TF-IDF and cosine similarity, Recroot streamlines resume screening and job matching. Built using Flask for the backend, hosted on Render, with resume storage on Cloudinary and real-time application tracking via Firebase, it delivers a full-stack, scalable recruitment solution. The frontend is developed in Flutter, supporting recruiters, candidates, and interviewers with dedicated views and workflows. From uploading resumes to scheduling interviews and tracking offers, Recroot offers an end-to-end hiring experience.",
  "techStack": ["Flutter", "Firebase", "Flask", "Render", "Cloudinary", "Python", "TF-IDF", "Cosine Similarity", "pdfplumber"],
  "liveLink": "https://youtu.be/u7HGmPe94FI?si=bh-P7wk-_qPPVkjn",
  "repoLink": "https://github.com/tejasgadge2504/Recroot"
}

]
